tutorials/coordination/solutions/eval.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Comparison of the different solutions for coordination</title>
<!-- 2016-05-13 Fri 13:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jason Team" />
</head>
<body>
<div id="content">
<h1 class="title">Comparison of the different solutions for coordination</h1>
<p>
Some comparison criteria:
</p>
<ul class="org-ul">
<li>what is the basic coordination mechanism?
</li>
<li>is the coordination inside or outside the agents? Inside =&gt; to change the protocol, the code of all agents need to be changed
</li>
<li>what does the agent need to know before to participate? (language, architecture)?
</li>
<li>how to find other agents?
</li>
<li>is the protocol explicitly described somewhere for the agents to "learn" the protocol?
</li>
<li>is it centralized?
</li>
<li>what is the performance?
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">oriented to</th>
<th scope="col" class="left">mechanism</th>
<th scope="col" class="left">coordination</th>
<th scope="col" class="left">requirements</th>
<th scope="col" class="left">acquaintances</th>
<th scope="col" class="left">explicit protocol</th>
<th scope="col" class="left">centralized</th>
<th scope="col" class="left">performance</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">agent</td>
<td class="left">ACL - simple</td>
<td class="left">inside</td>
<td class="left">ACL</td>
<td class="left">YP</td>
<td class="left">no</td>
<td class="left">no</td>
<td class="left"><i>2p + p<sup>2</sup></i> messages<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></td>
</tr>

<tr>
<td class="left">environment</td>
<td class="left">action/perception - simpler</td>
<td class="left">mixed<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup></td>
<td class="left">Cartago</td>
<td class="left">YP</td>
<td class="left">no</td>
<td class="left">no<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup></td>
<td class="left"><i>2+p</i> actions + <i>p<sup>2</sup></i> perceptions</td>
</tr>

<tr>
<td class="left">organization</td>
<td class="left">schemes - complex</td>
<td class="left">outside</td>
<td class="left">Moise</td>
<td class="left">by roles</td>
<td class="left">yes</td>
<td class="left">no<sup><a id="fnr.3.100" name="fnr.3.100" class="footref" href="#fn.3">3</a></sup></td>
<td class="left">idem env</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">+ org actions + org perception</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>


<p>
Remark: the organization is better for open systems, however it costs something (complexity of the application and performance).
</p>

<p>
ACL = Agent Communication Language
YP  = Yellow pages
</p>

<p>
p   = number of participants
</p>



<hr  />
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<i>p</i> announce messages, <i>p</i> winner messages (so <i>2p</i>), <i>p</i> bids to all participants (so <i>p<sup>2</sup></i>)
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
the agents still need to know <b>when</b> to bid, but some rules of the protocol can be externalized in the artifact
</p></div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p class="footpara">
several artifacts, one for each auction
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Jason Team</p>
<p class="date">Created: 2016-05-13 Fri 13:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.51.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>